/**
 * 取随机数
 * @param Min
 * @param Max
 * @returns
 */
function RandomNum(Min, Max) {
    var Range = Max - Min;
    var Rand = Math.random();
    var num = Min + Math.round(Rand * Range);
    return num;
}


function FormatDate(strTime) {
    var date = new Date(strTime);
    return date.getFullYear() + "-" + (date.getMonth() + 1) + "-" + date.getDate();
}

function FormatDate2(strTime, formatStr) {
    var _time = strTime.time != undefined ? strTime.time : strTime;
    var dateinstance = new Date(parseInt(_time));
    var dateformat = dateinstance.Format(formatStr); //"YYYY-MM-DD"
    return dateformat;
}

Date.prototype.Format = function (formatStr) {
    var str = formatStr;
    var Week = ['日', '一', '二', '三', '四', '五', '六'];

    str = str.replace(/yyyy|YYYY/, this.getFullYear());
    str = str.replace(/yy|YY/, (this.getYear() % 100) > 9 ? (this.getYear() % 100).toString() : '0' + (this.getYear() % 100));

    str = str.replace(/MM/, this.getMonth() >= 9 ? (this.getMonth() + 1).toString() : '0' + (this.getMonth() + 1));
    str = str.replace(/M/g, this.getMonth());

    str = str.replace(/w|W/g, Week[this.getDay()]);

    str = str.replace(/dd|DD/, this.getDate() > 9 ? this.getDate().toString() : '0' + this.getDate());
    str = str.replace(/d|D/g, this.getDate());

    str = str.replace(/hh|HH/, this.getHours() > 9 ? this.getHours().toString() : '0' + this.getHours());
    str = str.replace(/h|H/g, this.getHours());
    str = str.replace(/mm/, this.getMinutes() > 9 ? this.getMinutes().toString() : '0' + this.getMinutes());
    str = str.replace(/m/g, this.getMinutes());

    str = str.replace(/ss|SS/, this.getSeconds() > 9 ? this.getSeconds().toString() : '0' + this.getSeconds());
    str = str.replace(/s|S/g, this.getSeconds());

    return str;
}
/**
 *
 */
function padLeft(str, lenght) {
    if (str.length >= lenght)
        return str;
    else
        return padLeft("0" + str, lenght);
}

function clone(obj) {
    var o;
    if (typeof obj == "object") {
        if (obj === null) {
            o = null;
        } else {
            if (obj instanceof Array) {
                o = [];
                for (var i = 0, len = obj.length; i < len; i++) {
                    o.push(clone(obj[i]));
                }
            } else {
                o = {};
                for (var j in obj) {
                    o[j] = clone(obj[j]);
                }
            }
        }
    } else {
        o = obj;
    }
    return o;
}

function compare(propertyName) {
    return function (object1, object2) {
        var value1 = object1[propertyName];
        var value2 = object2[propertyName];
        if (value2 > value1) {
            return 1;
        } else if (value2 < value1) {
            return -1;
        } else {
            return 0;
        }
    }
}
var PROVINCE = [{"code": "110000", "name": "北京", "area": "16387.68", "people": "1961.24"}, {
    "code": "120000",
    "name": "天津",
    "area": "11675.86",
    "people": "1293.87"
}, {"code": "130000", "name": "河北", "area": "187577.08", "people": "7185.42"}, {
    "code": "140000",
    "name": "山西",
    "area": "156712.68",
    "people": "3571.21"
}, {"code": "150000", "name": "内蒙古", "area": "1139888.03", "people": "2470.63"}, {
    "code": "210000",
    "name": "辽宁",
    "area": "145854.08",
    "people": "4374.63"
}, {"code": "220000", "name": "吉林", "area": "190588.85", "people": "2745.28"}, {
    "code": "230000",
    "name": "黑龙江",
    "area": "451446.99",
    "people": "3831.40"
}, {"code": "310000", "name": "上海", "area": "7958.9", "people": "2301.92"}, {
    "code": "320000",
    "name": "江苏",
    "area": "102017.11",
    "people": "7866.09"
}, {"code": "330000", "name": "浙江", "area": "104592.32", "people": "5442.69"}, {
    "code": "340000",
    "name": "安徽",
    "area": "140237.54",
    "people": "5950.05"
}, {"code": "350000", "name": "福建", "area": "122298.63", "people": "3689.42"}, {
    "code": "360000",
    "name": "江西",
    "area": "167208.27",
    "people": "4456.78"
}, {"code": "370000", "name": "山东", "area": "156330.89", "people": "9579.27"}, {
    "code": "410000",
    "name": "河南",
    "area": "165703.36",
    "people": "9402.99"
}, {"code": "420000", "name": "湖北", "area": "186061.29", "people": "5723.77"}, {
    "code": "430000",
    "name": "湖南",
    "area": "212201.46",
    "people": "6570.07"
}, {"code": "440000", "name": "广东", "area": "177852.48", "people": "10432.04"}, {
    "code": "450000",
    "name": "广西",
    "area": "237049.57",
    "people": "4602.37"
}, {"code": "460000", "name": "海南", "area": "34063.5", "people": "867.14"}, {
    "code": "500000",
    "name": "重庆",
    "area": "82480.98",
    "people": "2884.61"
}, {"code": "510000", "name": "四川", "area": "486636.86", "people": "8041.75"}, {
    "code": "520000",
    "name": "贵州",
    "area": "176407.43",
    "people": "3474.85"
}, {"code": "530000", "name": "云南", "area": "384010.69", "people": "4596.67"}, {
    "code": "540000",
    "name": "西藏",
    "area": "1203457.11",
    "people": "300.21"
}, {"code": "610000", "name": "陕西", "area": "205566.69", "people": "3732.73"}, {
    "code": "620000",
    "name": "甘肃",
    "area": "425091.16",
    "people": "2557.52"
}, {"code": "630000", "name": "青海", "area": "696623.57", "people": "562.67"}, {
    "code": "640000",
    "name": "宁夏",
    "area": "51935.43",
    "people": "630.13"
}, {"code": "650000", "name": "新疆", "area": "1628780.29", "people": "2181.58"}];

var CITY = [{"code": "370100", "name": "济南市", "parent": "370000", "area": "7992.43", "people": "681.40"}, {
    "code": "370200",
    "name": "青岛市",
    "parent": "370000",
    "area": "11018.06",
    "people": "871.51"
}, {"code": "370300", "name": "<font color='red'>淄博市</font>", "parent": "370000", "area": "5963.34", "people": "453.06"}, {
    "code": "370400",
    "name": "枣庄市",
    "parent": "370000",
    "area": "4560.72",
    "people": "372.91"
}, {"code": "370500", "name": "东营市", "parent": "370000", "area": "7614.84", "people": "203.53"}, {
    "code": "370600",
    "name": "烟台市",
    "parent": "370000",
    "area": "13653.84",
    "people": "696.82"
}, {"code": "370700", "name": "潍坊市", "parent": "370000", "area": "15964.96", "people": "908.62"}, {
    "code": "370800",
    "name": "济宁市",
    "parent": "370000",
    "area": "11214.34",
    "people": "808.19"
}, {"code": "370900", "name": "泰安市", "parent": "370000", "area": "7750.49", "people": "549.42"}, {
    "code": "371000",
    "name": "威海市",
    "parent": "370000",
    "area": "5636.84",
    "people": "280.47"
}, {"code": "371100", "name": "日照市", "parent": "370000", "area": "5316.29", "people": "280.10"}, {
    "code": "371200",
    "name": "莱芜市",
    "parent": "370000",
    "area": "2247.21",
    "people": "129.85"
}, {"code": "371300", "name": "临沂市", "parent": "370000", "area": "17199.9", "people": "1003.94"}, {
    "code": "371400",
    "name": "德州市",
    "parent": "370000",
    "area": "10336.98",
    "people": "556.82"
}, {"code": "371500", "name": "聊城市", "parent": "370000", "area": "8637.06", "people": "578.98"}, {
    "code": "371600",
    "name": "滨州市",
    "parent": "370000",
    "area": "9059.47",
    "people": "374.84"
}, {"code": "371700", "name": "菏泽市", "parent": "370000", "area": "12164.85", "people": "828.76"}];

var COUNTY = [{"code": "370302", "name": "淄川区", "parent": "370300", "people": "73.18", "area": "1000.24"}, {
    "code": "370303",
    "name": "张店区",
    "parent": "370300",
    "people": "92.92",
    "area": "358.51"
}, {"code": "370304", "name": "博山区", "parent": "370300", "people": "46.3", "area": "697.16"}, {
    "code": "370305",
    "name": "<font color='red'>临淄区</font>",
    "parent": "370300",
    "people": "64.28",
    "area": "666.74"
}, {"code": "370306", "name": "周村区", "parent": "370300", "people": "36.23", "area": "266.37"}, {
    "code": "370321",
    "name": "桓台县",
    "parent": "370300",
    "people": "50.4",
    "area": "503.77"
}, {"code": "370322", "name": "高青县", "parent": "370300", "people": "34.79", "area": "834.88"}, {
    "code": "370323",
    "name": "沂源县",
    "parent": "370300",
    "people": "54.95",
    "area": "1635.68"
}];

var XIANG = [{"code": "370305004", "name": "稷下街道", "parent": "370305"}, {"code": "370305005", "name": "齐陵街道", "parent": "370305"}, {
    "code": "370305100",
    "name": "齐都镇",
    "parent": "370305"
}, {"code": "370305102", "name": "<font color='red'>皇城镇</font>", "parent": "370305"}, {
    "code": "370305103",
    "name": "敬仲镇镇集体",
    "parent": "370305"
}, {"code": "370305104", "name": "朱台镇镇集体", "parent": "370305"}, {"code": "370305107", "name": "金岭回族镇", "parent": "370305"}, {
    "code": "370305109",
    "name": "凤凰镇",
    "parent": "370305"
}, {"code": "370305201", "name": "金山镇", "parent": "370305"}, {"code": "370305003", "name": "辛店城区", "parent": "370305"}];

var CUN = [{"code": "370305102238", "name": "崔郭村委会", "parent": "370305102"}, {
    "code": "370305102239",
    "name": "北羊村委会",
    "parent": "370305102"
}, {"code": "370305102240", "name": "<font color='red'>南卧石村委会</font>", "parent": "370305102"}, {
    "code": "370305102241",
    "name": "店子村委会",
    "parent": "370305102"
}, {"code": "370305102242", "name": "郭家村委会", "parent": "370305102"}, {"code": "370305102243", "name": "东南羊村委会", "parent": "370305102"}, {
    "code": "370305102244",
    "name": "西南羊村委会",
    "parent": "370305102"
}, {"code": "370305102245", "name": "西上村委会", "parent": "370305102"}, {"code": "370305102246", "name": "东上村委会", "parent": "370305102"}, {
    "code": "370305102247",
    "name": "前下村委会",
    "parent": "370305102"
}, {"code": "370305102248", "name": "后下村委会", "parent": "370305102"}, {"code": "370305102249", "name": "东官村委会", "parent": "370305102"}, {
    "code": "370305102250",
    "name": "麻卸村委会",
    "parent": "370305102"
}, {"code": "370305103201", "name": "白丘北村委会", "parent": "370305103"}, {
    "code": "370305103202",
    "name": "白兔丘南村委会",
    "parent": "370305103"
}, {"code": "370305103203", "name": "朱家北村委会", "parent": "370305103"}, {"code": "370305103204", "name": "户王村委会", "parent": "370305103"}, {
    "code": "370305103205",
    "name": "东张王村委会",
    "parent": "370305103"
}, {"code": "370305103206", "name": "刘王村委会", "parent": "370305103"}, {"code": "370305103207", "name": "小东王村委会", "parent": "370305103"}, {
    "code": "370305103208",
    "name": "蔡王村委会",
    "parent": "370305103"
}, {"code": "370305103209", "name": "东郝家村委会", "parent": "370305103"}, {
    "code": "370305103210",
    "name": "北冯家村委会",
    "parent": "370305103"
}, {"code": "370305103211", "name": "河沟村委会", "parent": "370305103"}, {"code": "370305103212", "name": "呈羔东村委会", "parent": "370305103"}, {
    "code": "370305103213",
    "name": "呈羔西村委会",
    "parent": "370305103"
}, {"code": "370305103214", "name": "北陈家村委会", "parent": "370305103"}, {"code": "370305103215", "name": "双庙村委会", "parent": "370305103"}, {
    "code": "370305103216",
    "name": "二张村委会",
    "parent": "370305103"
}, {"code": "370305103217", "name": "李家西村委会", "parent": "370305103"}, {
    "code": "370305103218",
    "name": "李家南村委会",
    "parent": "370305103"
}, {"code": "370305103219", "name": "李家东村委会", "parent": "370305103"}, {"code": "370305103220", "name": "西姬村委会", "parent": "370305103"}, {
    "code": "370305103221",
    "name": "东姬村委会",
    "parent": "370305103"
}, {"code": "370305103222", "name": "北石桥村委会", "parent": "370305103"}, {"code": "370305103223", "name": "辛路村委会", "parent": "370305103"}, {
    "code": "370305103224",
    "name": "毛家村村委会",
    "parent": "370305103"
}, {"code": "370305103225", "name": "北刘家村委会", "parent": "370305103"}, {
    "code": "370305103226",
    "name": "北谢家村委会",
    "parent": "370305103"
}, {"code": "370305103227", "name": "东苇河村委会", "parent": "370305103"}, {
    "code": "370305103228",
    "name": "西苇河村委会",
    "parent": "370305103"
}, {"code": "370305103229", "name": "北伯村委会", "parent": "370305103"}, {"code": "370305103230", "name": "蔡店村委会", "parent": "370305103"}, {
    "code": "370305103231",
    "name": "钓鱼村委会",
    "parent": "370305103"
}, {"code": "370305103232", "name": "东胡村委会", "parent": "370305103"}, {"code": "370305103233", "name": "西胡村委会", "parent": "370305103"}, {
    "code": "370305103234",
    "name": "毕家村委会",
    "parent": "370305103"
}, {"code": "370305103235", "name": "北赵家村委会", "parent": "370305103"}, {
    "code": "370305103236",
    "name": "许家屯村委会",
    "parent": "370305103"
}, {"code": "370305103237", "name": "杨官村委会", "parent": "370305103"}, {"code": "370305103238", "name": "崔官村委会", "parent": "370305103"}, {
    "code": "370305103239",
    "name": "李官村委会",
    "parent": "370305103"
}, {"code": "370305103240", "name": "东柳村委会", "parent": "370305103"}, {"code": "370305103241", "name": "西柳村委会", "parent": "370305103"}, {
    "code": "370305103242",
    "name": "褚家村委会",
    "parent": "370305103"
}, {"code": "370305103243", "name": "东周村委会", "parent": "370305103"}, {"code": "370305103244", "name": "西周村委会", "parent": "370305103"}, {
    "code": "370305103245",
    "name": "东王官村委会",
    "parent": "370305103"
}, {"code": "370305103246", "name": "西王官村委会", "parent": "370305103"}, {"code": "370305103247", "name": "岳家村委会", "parent": "370305103"}, {
    "code": "370305103248",
    "name": "徐家圈村委会",
    "parent": "370305103"
}, {"code": "370305103249", "name": "大寇村委会", "parent": "370305103"}, {"code": "370305103250", "name": "小叩村委会", "parent": "370305103"}, {
    "code": "370305104201",
    "name": "桐林村委会",
    "parent": "370305104"
}, {"code": "370305104202", "name": "宋桥村委会", "parent": "370305104"}, {"code": "370305104203", "name": "杨店村委会", "parent": "370305104"}, {
    "code": "370305104204",
    "name": "义和村委会",
    "parent": "370305104"
}, {"code": "370305104205", "name": "立子营村委会", "parent": "370305104"}, {"code": "370305104206", "name": "新立村委会", "parent": "370305104"}, {
    "code": "370305104207",
    "name": "朱台西村委会",
    "parent": "370305104"
}, {"code": "370305104208", "name": "朱台东村委会", "parent": "370305104"}, {
    "code": "370305104209",
    "name": "朱台北村委会",
    "parent": "370305104"
}, {"code": "370305104210", "name": "薛家官村委会", "parent": "370305104"}, {"code": "370305104211", "name": "后夏村委会", "parent": "370305104"}, {
    "code": "370305104212",
    "name": "枣园村委会",
    "parent": "370305104"
}, {"code": "370305104213", "name": "花沟村委会", "parent": "370305104"}, {"code": "370305104214", "name": "东单村委会", "parent": "370305104"}, {
    "code": "370305104215",
    "name": "于官村委会",
    "parent": "370305104"
}, {"code": "370305104216", "name": "西单村委会", "parent": "370305104"}, {"code": "370305104217", "name": "王营村委会", "parent": "370305104"}, {
    "code": "370305104218",
    "name": "房家村委会",
    "parent": "370305104"
}, {"code": "370305104219", "name": "耿家坡村委会", "parent": "370305104"}, {"code": "370305104220", "name": "大柳村委会", "parent": "370305104"}, {
    "code": "370305104221",
    "name": "大夫店村委会",
    "parent": "370305104"
}, {"code": "370305104222", "name": "西张旺村委会", "parent": "370305104"}, {"code": "370305104223", "name": "麻王村委会", "parent": "370305104"}, {
    "code": "370305104224",
    "name": "西魏家村委会",
    "parent": "370305104"
}, {"code": "370305104225", "name": "罗家村委会", "parent": "370305104"}, {"code": "370305104226", "name": "陈营村委会", "parent": "370305104"}, {
    "code": "370305104227",
    "name": "北高东村委会",
    "parent": "370305104"
}, {"code": "370305104228", "name": "北高西村委会", "parent": "370305104"}, {
    "code": "370305104229",
    "name": "北高南村委会",
    "parent": "370305104"
}, {"code": "370305104230", "name": "谢家屯村委会", "parent": "370305104"}, {"code": "370305104231", "name": "殷家村委会", "parent": "370305104"}, {
    "code": "370305104232",
    "name": "香坊村委会",
    "parent": "370305104"
}, {"code": "370305104233", "name": "徐王村委会", "parent": "370305104"}, {"code": "370305104234", "name": "槐务东村委会", "parent": "370305104"}, {
    "code": "370305104235",
    "name": "槐务西村委会",
    "parent": "370305104"
}, {"code": "370305104236", "name": "槐务北村委会", "parent": "370305104"}, {"code": "370305104237", "name": "徐屯村委会", "parent": "370305104"}, {
    "code": "370305104238",
    "name": "刘百户村委会",
    "parent": "370305104"
}, {"code": "370305104239", "name": "东台村委会", "parent": "370305104"}, {"code": "370305104240", "name": "鲁家村委会", "parent": "370305104"}, {
    "code": "370305104241",
    "name": "史家村委会",
    "parent": "370305104"
}, {"code": "370305104242", "name": "南高村委会", "parent": "370305104"}, {"code": "370305104243", "name": "高家村委会", "parent": "370305104"}, {
    "code": "370305104244",
    "name": "王庄东村委会",
    "parent": "370305104"
}, {"code": "370305104245", "name": "王庄西村委会", "parent": "370305104"}, {
    "code": "370305104246",
    "name": "王庄北村委会",
    "parent": "370305104"
}, {"code": "370305104247", "name": "衙里村委会", "parent": "370305104"}, {"code": "370305104248", "name": "上河东村委会", "parent": "370305104"}, {
    "code": "370305104249",
    "name": "上河西村委会",
    "parent": "370305104"
}, {"code": "370305104250", "name": "前夏东村委会", "parent": "370305104"}, {
    "code": "370305104251",
    "name": "前夏西村委会",
    "parent": "370305104"
}, {"code": "370305104252", "name": "宁王西村委会", "parent": "370305104"}, {
    "code": "370305104253",
    "name": "宁王南村委会",
    "parent": "370305104"
}, {"code": "370305104254", "name": "宁王东村委会", "parent": "370305104"}, {
    "code": "370305104255",
    "name": "宁王北村委会",
    "parent": "370305104"
}, {"code": "370305104256", "name": "建立村委会", "parent": "370305104"}, {"code": "370305104257", "name": "革新村委会", "parent": "370305104"}, {
    "code": "370305107001",
    "name": "金南居委会",
    "parent": "370305107"
}, {"code": "370305107201", "name": "金岭一村委会", "parent": "370305107"}, {
    "code": "370305107202",
    "name": "金岭二村委会",
    "parent": "370305107"
}, {"code": "370305107203", "name": "金岭三村委会", "parent": "370305107"}, {
    "code": "370305107204",
    "name": "金岭四村委会",
    "parent": "370305107"
}, {"code": "370305107205", "name": "金岭五村委会", "parent": "370305107"}, {
    "code": "370305107206",
    "name": "金岭六村委会",
    "parent": "370305107"
}, {"code": "370305107207", "name": "艾庄村委会", "parent": "370305107"}, {"code": "370305107208", "name": "刘辛村委会", "parent": "370305107"}, {
    "code": "370305107209",
    "name": "披甲村委会",
    "parent": "370305107"
}, {"code": "370305109201", "name": "大路南村", "parent": "370305109"}, {"code": "370305109202", "name": "大路北村", "parent": "370305109"}, {
    "code": "370305109203",
    "name": "大路东村",
    "parent": "370305109"
}, {"code": "370305109204", "name": "北田旺村", "parent": "370305109"}, {"code": "370305109205", "name": "山庄村", "parent": "370305109"}, {
    "code": "370305109206",
    "name": "西陈家村",
    "parent": "370305109"
}, {"code": "370305109207", "name": "西郝家村", "parent": "370305109"}, {"code": "370305109208", "name": "西路村", "parent": "370305109"}, {
    "code": "370305109209",
    "name": "寇家村",
    "parent": "370305109"
}, {"code": "370305109210", "name": "周家屯村", "parent": "370305109"}, {"code": "370305109211", "name": "西申村", "parent": "370305109"}, {
    "code": "370305109212",
    "name": "卢家营村",
    "parent": "370305109"
}, {"code": "370305109213", "name": "东申村", "parent": "370305109"}, {"code": "370305109214", "name": "朱家屯村", "parent": "370305109"}, {
    "code": "370305109215",
    "name": "北罗村",
    "parent": "370305109"
}, {"code": "370305109216", "name": "梁家村", "parent": "370305109"}, {"code": "370305109217", "name": "南罗村", "parent": "370305109"}, {
    "code": "370305109218",
    "name": "王桥村",
    "parent": "370305109"
}, {"code": "370305109219", "name": "大薄村", "parent": "370305109"}, {"code": "370305109220", "name": "小张村", "parent": "370305109"}, {
    "code": "370305109221",
    "name": "大张村",
    "parent": "370305109"
}, {"code": "370305109222", "name": "侯家屯村", "parent": "370305109"}, {"code": "370305109223", "name": "东召南村", "parent": "370305109"}, {
    "code": "370305109224",
    "name": "东召村",
    "parent": "370305109"
}, {"code": "370305109225", "name": "东召北村", "parent": "370305109"}, {"code": "370305109226", "name": "东召西村", "parent": "370305109"}, {
    "code": "370305109227",
    "name": "西召村",
    "parent": "370305109"
}, {"code": "370305109228", "name": "东齐村", "parent": "370305109"}, {"code": "370305109229", "name": "中齐村", "parent": "370305109"}, {
    "code": "370305109230",
    "name": "西齐村",
    "parent": "370305109"
}, {"code": "370305109231", "name": "小曹村", "parent": "370305109"}, {"code": "370305109232", "name": "赵家村", "parent": "370305109"}, {
    "code": "370305109233",
    "name": "郭家桥村",
    "parent": "370305109"
}, {"code": "370305109234", "name": "天务村", "parent": "370305109"}, {"code": "370305109235", "name": "蒋家村", "parent": "370305109"}, {
    "code": "370305109236",
    "name": "南坞东村",
    "parent": "370305109"
}, {"code": "370305109237", "name": "南坞西村", "parent": "370305109"}, {"code": "370305109238", "name": "北龙村", "parent": "370305109"}, {
    "code": "370305109239",
    "name": "红花村",
    "parent": "370305109"
}, {"code": "370305109240", "name": "北金村", "parent": "370305109"}, {"code": "370305109241", "name": "中金村", "parent": "370305109"}, {
    "code": "370305109242",
    "name": "南金村",
    "parent": "370305109"
}, {"code": "370305109243", "name": "温家村", "parent": "370305109"}, {"code": "370305109244", "name": "李家桥村", "parent": "370305109"}, {
    "code": "370305109245",
    "name": "吴家村",
    "parent": "370305109"
}, {"code": "370305109246", "name": "九仙村", "parent": "370305109"}, {"code": "370305109247", "name": "西于家村", "parent": "370305109"}, {
    "code": "370305109248",
    "name": "小徐家村",
    "parent": "370305109"
}, {"code": "370305109249", "name": "台东齐村", "parent": "370305109"}, {"code": "370305109250", "name": "柴南村", "parent": "370305109"}, {
    "code": "370305109251",
    "name": "柴北村",
    "parent": "370305109"
}, {"code": "370305109252", "name": "王青村", "parent": "370305109"}, {"code": "370305109253", "name": "土桥村", "parent": "370305109"}, {
    "code": "370305109254",
    "name": "林家村",
    "parent": "370305109"
}, {"code": "370305109255", "name": "史家村村", "parent": "370305109"}, {"code": "370305109256", "name": "刘地村", "parent": "370305109"}, {
    "code": "370305109257",
    "name": "王青屯村",
    "parent": "370305109"
}, {"code": "370305109258", "name": "南霸村", "parent": "370305109"}, {"code": "370305109259", "name": "北曹村", "parent": "370305109"}, {
    "code": "370305109260",
    "name": "北王村",
    "parent": "370305109"
}, {"code": "370305109261", "name": "西梧村", "parent": "370305109"}, {"code": "370305109262", "name": "东梧村", "parent": "370305109"}, {
    "code": "370305109263",
    "name": "西刘村",
    "parent": "370305109"
}, {"code": "370305109264", "name": "南齐村", "parent": "370305109"}, {"code": "370305109265", "name": "南王村", "parent": "370305109"}, {
    "code": "370305109266",
    "name": "南曹村",
    "parent": "370305109"
}, {"code": "370305109267", "name": "北安合村", "parent": "370305109"}, {"code": "370305109268", "name": "南太合村", "parent": "370305109"}, {
    "code": "370305109269",
    "name": "辛兴村",
    "parent": "370305109"
}, {"code": "370305109270", "name": "水牛村", "parent": "370305109"}, {"code": "370305109271", "name": "西老村", "parent": "370305109"}, {
    "code": "370305109272",
    "name": "东老村",
    "parent": "370305109"
}, {"code": "370305109273", "name": "西河村", "parent": "370305109"}, {"code": "370305109274", "name": "东河村", "parent": "370305109"}, {
    "code": "370305109275",
    "name": "彩家村",
    "parent": "370305109"
}, {"code": "370305201201", "name": "金阳村委会", "parent": "370305201"}, {"code": "370305201202", "name": "边河村委会", "parent": "370305201"}, {
    "code": "370305201203",
    "name": "西刘村村委会",
    "parent": "370305201"
}, {"code": "370305201204", "name": "瑟雅村村委会", "parent": "370305201"}, {
    "code": "370305201205",
    "name": "小寨村村委会",
    "parent": "370305201"
}, {"code": "370305201206", "name": "赵庄村村委会", "parent": "370305201"}, {
    "code": "370305201207",
    "name": "北刘村村委会",
    "parent": "370305201"
}, {"code": "370305201208", "name": "崔碾村村委会", "parent": "370305201"}, {
    "code": "370305201209",
    "name": "东张村村委会",
    "parent": "370305201"
}, {"code": "370305201210", "name": "西张村村委会", "parent": "370305201"}, {"code": "370305201211", "name": "北崖村委会", "parent": "370305201"}, {
    "code": "370305201212",
    "name": "东崖村委会",
    "parent": "370305201"
}, {"code": "370305201213", "name": "西崖村委会", "parent": "370305201"}, {"code": "370305201214", "name": "南术南村委会", "parent": "370305201"}, {
    "code": "370305201215",
    "name": "西太平村委会",
    "parent": "370305201"
}, {"code": "370305201216", "name": "袁上村委会", "parent": "370305201"}, {"code": "370305201217", "name": "中疃村委会", "parent": "370305201"}, {
    "code": "370305201218",
    "name": "南术西村委会",
    "parent": "370305201"
}, {"code": "370305201219", "name": "南术北村委会", "parent": "370305201"}, {"code": "370305201220", "name": "坡子村委会", "parent": "370305201"}, {
    "code": "370305201221",
    "name": "黎金山村委会",
    "parent": "370305201"
}, {"code": "370305201222", "name": "闫下村委会", "parent": "370305201"}, {"code": "370305201223", "name": "田旺村委会", "parent": "370305201"}, {
    "code": "370305201224",
    "name": "搭岭村委会",
    "parent": "370305201"
}, {"code": "370305201225", "name": "大寨村委会", "parent": "370305201"}, {"code": "370305201226", "name": "徐旺村委会", "parent": "370305201"}, {
    "code": "370305201227",
    "name": "吴胡同村委会",
    "parent": "370305201"
}, {"code": "370305201228", "name": "涧西村委会", "parent": "370305201"}, {"code": "370305201229", "name": "杨上村委会", "parent": "370305201"}, {
    "code": "370305201230",
    "name": "辛庄村委会",
    "parent": "370305201"
}, {"code": "370305201231", "name": "南仇东居委会", "parent": "370305201"}, {
    "code": "370305201232",
    "name": "南仇西居委会",
    "parent": "370305201"
}, {"code": "370305201233", "name": "南仇南居委会", "parent": "370305201"}, {
    "code": "370305201234",
    "name": "南仇北居委会",
    "parent": "370305201"
}, {"code": "370305201235", "name": "福山居委会", "parent": "370305201"}, {"code": "370305201241", "name": "南杨村委会", "parent": "370305201"}, {
    "code": "370305201242",
    "name": "王寨东村委会",
    "parent": "370305201"
}, {"code": "370305201243", "name": "王寨西村委会", "parent": "370305201"}, {
    "code": "370305201244",
    "name": "业旺东村委会",
    "parent": "370305201"
}, {"code": "370305201245", "name": "业旺西村委会", "parent": "370305201"}, {"code": "370305201246", "name": "冯家村委会", "parent": "370305201"}, {
    "code": "370305201247",
    "name": "韩家村村委会",
    "parent": "370305201"
}, {"code": "370305201248", "name": "边家村村委会", "parent": "370305201"}, {
    "code": "370305201249",
    "name": "路口村村委会",
    "parent": "370305201"
}, {"code": "370305201250", "name": "马家村村委会", "parent": "370305201"}, {
    "code": "370305201251",
    "name": "于家村村委会",
    "parent": "370305201"
}, {"code": "370305201252", "name": "洋浒崖村委会", "parent": "370305201"}, {"code": "370305201253", "name": "左庄村委会", "parent": "370305201"}];

var ZU=[{"code": "37030510223801", "name": "1组", "parent": "370305102238"},
        {"code": "37030510223802", "name": "2组", "parent": "370305102238"}];

var MING = ["涛", "昌", "进", "林", "有", "坚", "和", "彪", "博", "诚", "先", "敬", "震", "振", "壮", "会", "群", "豪", "心", "邦", "承", "乐", "绍", "功", "松", "善", "厚", "庆"];
//28
var XING = ["赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "楮", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华"];


//坐落
var FDZL = ["东", "西", "南", "北", "前", "中", "后"];
var FDZLENTITY = ["小区", "房"];

var YEAR = ["1998", "1999", "2000", "2001", "2002", "2003", "2004", "2005", "2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017"]
var MONTH = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12"];
var DAY = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28"];
//经营主体类型
var JYZTLX = ["种植大户", "家庭农场", "农民合作社", "龙头企业"];
//四川市级，copy山东市级数据，仅修改了name及数量，其余未作修改
var SCCITY = [{"code": "370100", "name": "成都市", "parent": "370000", "area": "7992.43", "people": "681.40"}, {
    "code": "370200",
    "name": "绵阳市",
    "parent": "370000",
    "area": "11018.06",
    "people": "871.51"
}, {"code": "370300", "name": "自贡市", "parent": "370000", "area": "5963.34", "people": "453.06"}, {
    "code": "370400",
    "name": "攀枝花市",
    "parent": "370000",
    "area": "4560.72",
    "people": "372.91"
}, {"code": "370500", "name": "泸州市", "parent": "370000", "area": "7614.84", "people": "203.53"}, {
    "code": "370600",
    "name": "德阳市",
    "parent": "370000",
    "area": "13653.84",
    "people": "696.82"
}, {"code": "370700", "name": "广元市", "parent": "370000", "area": "15964.96", "people": "908.62"}, {
    "code": "370800",
    "name": "遂宁市",
    "parent": "370000",
    "area": "11214.34",
    "people": "808.19"
}, {"code": "370900", "name": "内江市", "parent": "370000", "area": "7750.49", "people": "549.42"}, {
    "code": "371000",
    "name": "乐山市",
    "parent": "370000",
    "area": "5636.84",
    "people": "280.47"
}, {"code": "371100", "name": "资阳市", "parent": "370000", "area": "5316.29", "people": "280.10"}, {
    "code": "371200",
    "name": "宜宾市",
    "parent": "370000",
    "area": "2247.21",
    "people": "129.85"
}, {"code": "371300", "name": "南充市", "parent": "370000", "area": "17199.9", "people": "1003.94"}, {
    "code": "371400",
    "name": "<font color='red'>达州市</font>",
    "parent": "370000",
    "area": "10336.98",
    "people": "556.82"
}, {"code": "371500", "name": "雅安市", "parent": "370000", "area": "8637.06", "people": "578.98"}, {
    "code": "371600",
    "name": "广安市",
    "parent": "370000",
    "area": "9059.47",
    "people": "374.84"
}, {"code": "371700", "name": "巴中市", "parent": "370000", "area": "12164.85", "people": "828.76"}
    , {"code": "371700", "name": "眉山市", "parent": "370000", "area": "12164.85", "people": "828.76"}
    , {"code": "371700", "name": "阿坝藏族羌族自治州", "parent": "370000", "area": "12164.85", "people": "828.76"}
    , {"code": "371700", "name": "甘孜藏族自治州", "parent": "370000", "area": "12164.85", "people": "828.76"}
    , {"code": "371700", "name": "凉山彝族自治州", "parent": "370000", "area": "12164.85", "people": "828.76"}];
//四川区县，copy山东县级数据，仅修改了name及数量，其余未作修改
var SCCOUNTY = [{"code": "370302", "name": "<font color='red'>通川区</font>", "parent": "370300", "people": "73.18", "area": "1000.24"}, {
    "code": "370303",
    "name": "达川区",
    "parent": "370300",
    "people": "92.92",
    "area": "358.51"
}, {"code": "370304", "name": "宣汉县", "parent": "370300", "people": "46.3", "area": "697.16"}, {
    "code": "370305",
    "name": "开江县",
    "parent": "370300",
    "people": "64.28",
    "area": "666.74"
}, {"code": "370306", "name": "大竹县", "parent": "370300", "people": "36.23", "area": "266.37"}, {
    "code": "370321",
    "name": "渠县",
    "parent": "370300",
    "people": "50.4",
    "area": "503.77"
}, {"code": "370322", "name": "万源市", "parent": "370300", "people": "34.79", "area": "834.88"}];


